
1.内存管理
2.多线程
3.网络编程
4.数据存储
5.设计模式和架构
6.版本控制工具git
7.swift

1.基础知识开发框架和APIs
2.网络编程，熟悉HTTP/HTTPS协议，了解TCP/IP和UDP等网络协议。此外，你也需要了解如何使用AFNetworking或URLSession等网络请求库
3.IM相关，实时消息传送、用户在线状态、消息加密等。你还需要了解如何处理网络断开和重连的情况，保证用户聊天的稳定性和可靠性。
4.数据库和存储，Core Data或Realm等ORM框架，也可以使用SQLite或C++等原生数据库
5.应用安全，了解常见的安全漏洞和攻击方式，例如SQL注入、跨站脚本攻击等。你也需要掌握基本的加密算法和安全协议，例如SSL/TLS等。
6.性能优化，了解如何优化应用的性能。这包括内存管理、多线程、渲染优化等技术。

1.基础知识
2.设计模式和架构
3.网络编程，im相关
4.多线程（线程锁，线程安全，线程管理，死锁/优先级反转，线程导致崩溃的场景）
5.数据存储，数据库设计，数据库优化 （Core Data或Realm等ORM框架，也可以使用SQLite或C++等原生数据库）
6.性能优化：内存管理，渲染优化
7.应用安全：加密算法，安全协议，例如SSL/TLS等，了解常见的安全漏洞和攻击方式，例如SQL注入、跨站脚本攻击等
8.版本控制git
9.swift

重点：
1.设计模式和架构
2.网络编程，im相关
3.多线程
4.数据库设计与优化
5.项目哪些地方做过优化（数据库优化，会话列表，聊天页面数据加载，好友表和群成员表大数据优化，消息大量接收优化）

1.学习路线，整理重要知识点，3天
2.重点内容的学习，10天
3.次要内容学习， 3天
4.刷面试题，5天
5.swift学习，

1.筛选重点分支知识，整理次要知识点
2.整理每块知识点达到能面试程度
